Revit 2027 API
ParameterTypeId.StructuralAnalyticalProjectFloorPlane Property
 "Vertical Projection"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralAnalyticalProjectFloorPlane { get; }
Public Shared ReadOnly Property StructuralAnalyticalProjectFloorPlane As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralAnalyticalProjectFloorPlane {
	ForgeTypeId^ get ();
}
static member StructuralAnalyticalProjectFloorPlane : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace